---
kind: type
id: T:Autodesk.Revit.DB.Events.FileImportedEventArgs
source: html/87f5b053-2c42-7b57-a58d-4b2489f461cc.htm
---
# Autodesk.Revit.DB.Events.FileImportedEventArgs

The event arguments used by the FileImported event.

## Syntax (C#)
```csharp
public class FileImportedEventArgs : RevitAPIPostDocEventArgs
```